lockbox/qemu-stmf746ie/hw/arm/stm32f746ie.c
/*
 * Netduino Plus 2 Machine Model
 *
 * Copyright (c) 2023 lockbox <lockbox.06@protonmail.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/boards.h"
#include "hw/qdev-properties.h"
#include "hw/qdev-clock.h"
#include "qemu/error-report.h"
#include "hw/arm/stm32f746_soc.h"
#include "hw/arm/boot.h"

/* Main SYSCLK frequency in Hz (216MHz) */
#define SYSCLK_FRQ 216000000ULL

static void stm32f746ie_init(MachineState *machine) {
  DeviceState *dev;
  Clock *sysclk;

  /* This clock doesn't need migration because it is fixed-frequency */
  sysclk = clock_new(OBJECT(machine), "SYSCLK");
  clock_set_hz(sysclk, SYSCLK_FRQ);

  dev = qdev_new(TYPE_STM32F746_SOC);
  qdev_prop_set_string(dev, "cpu-type", ARM_CPU_TYPE_NAME("cortex-m7"));
  qdev_connect_clock_in(dev, "sysclk", sysclk);
  sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

  armv7m_load_kernel(ARM_CPU(first_cpu), machine->kernel_filename,
                     FLASH_BASE_ADDRESS, FLASH_SIZE);
}

static void stm32f746ie_machine_init(MachineClass *mc) {
  mc->desc = "STM32F746IE (Cortex-M7)";
  mc->init = stm32f746ie_init;
}

DEFINE_MACHINE("STM32F746IE", stm32f746ie_machine_init)
